tap "arcadiapower/tap"
tap "aws/tap"
tap "beeftornado/rmtree"
tap "coinbase/assume-role"
tap "derailed/k9s"
tap "fishtown-analytics/dbt"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "weaveworks/tap"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# Asynchronous DNS library
brew "c-ares"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# DuckDuckGo from the terminal
brew "ddgr"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# CLI to retrieve AWS credentials from Okta
brew "gimme-aws-creds"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# GNU troff text-formatting system
brew "groff"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Easy way to access the system keyring service from python
brew "keyring"
# Network authentication protocol
brew "krb5"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Library for encoding and decoding .avif files
brew "libavif"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Common error values for all GnuPG components
brew "libgpg-error"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# X.509 and CMS library
brew "libksba"
# LLVM's OpenMP runtime library
brew "libomp"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# NaCl networking and cryptography library
brew "libsodium"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Run a Kubernetes cluster locally
brew "minikube"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Highly capable, feature-rich programming language
brew "perl"
# Object-relational database system
brew "postgresql@11"
# Object-relational database system
brew "postgresql@12"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Provides fake name and address data
brew "rig"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.0"
# Safe, concurrent, practical language
brew "rust"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Linter for Terraform files
brew "tflint"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# PDF viewer
brew "xpdf"
# JavaScript package manager
brew "yarn"
# A helper utility for switching AWS profiles in subshells.
brew "arcadiapower/tap/axolotl"
brew "coinbase/assume-role/assume-role"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Terraform
brew "hashicorp/tap/terraform"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Text editor
cask "emacs"
# Open-source keystroke visualiser
cask "keycastr"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
vscode "bierner.markdown-preview-github-styles"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "vscodevim.vim"
