tap "aws/tap"
tap "beeftornado/rmtree"
tap "coinbase/assume-role"
tap "derailed/k9s"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "weaveworks/tap"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU database manager
brew "gdbm"
# Official Amazon AWS command-line interface
brew "awscli"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Search and News from the command-line
brew "googler"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Cross platform, open source .NET development framework
brew "mono"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# Apache Parquet command-line tools and utilities
brew "parquet-tools"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@11"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Provides fake name and address data
brew "rig"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Extensible IRC client
brew "weechat"
# PDF viewer
brew "xpdf"
# JavaScript package manager
brew "yarn"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
brew "coinbase/assume-role/assume-role"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Text editor
cask "emacs"
# Open-source keystroke visualizer
cask "keycastr"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
